#### HermiteSplineTangents Members

---

|  |
| --- |
| HermiteSplineTangents Class   Constructors   Methods   Properties   See Also |

The  HermiteSplineTangents  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | HermiteSplineTangents | Constructs a new default instance of the class, with tangent vectors uninitialized. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  HermiteSplineTangents |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | EndTangent | The tangent vector at the end of the curve. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | StartTangent | The tangent vector at the start of the curve. |

# See Also

HermiteSplineTangents Class

Autodesk.Revit.DB Namespace